fio/fio_disk/disk_xfs/log/RAID0/log_39/sdg/fio_randwrite_04k.log
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=6367: Tue Jul 24 18:20:05 2018
  write: IOPS=229, BW=918KiB/s (940kB/s)(1024MiB/1142249msec)
    slat (usec): min=3, max=163, avg=28.08, stdev= 9.43
    clat (usec): min=338, max=1768.0k, avg=278834.63, stdev=148010.10
     lat (usec): min=366, max=1769.0k, avg=278863.27, stdev=148011.45
    clat percentiles (msec):
     |  1.00th=[   17],  5.00th=[   38], 10.00th=[  140], 20.00th=[  176],
     | 30.00th=[  205], 40.00th=[  234], 50.00th=[  264], 60.00th=[  292],
     | 70.00th=[  326], 80.00th=[  359], 90.00th=[  422], 95.00th=[  550],
     | 99.00th=[  818], 99.50th=[  911], 99.90th=[ 1133], 99.95th=[ 1183],
     | 99.99th=[ 1351]
   bw (  KiB/s): min=    8, max= 2608, per=100.00%, avg=923.91, stdev=211.39, samples=2270
   iops        : min=    2, max=  652, avg=230.95, stdev=52.85, samples=2270
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.08%, 20=1.83%, 50=3.60%
  lat (msec)   : 100=1.61%, 250=38.43%, 500=48.00%, 750=4.87%, 1000=1.29%
  lat (msec)   : 2000=0.28%
  cpu          : usr=0.29%, sys=0.96%, ctx=262132, majf=0, minf=386
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=918KiB/s (940kB/s), 918KiB/s-918KiB/s (940kB/s-940kB/s), io=1024MiB (1074MB), run=1142249-1142249msec

Disk stats (read/write):
  sdg: ios=0/262208, merge=0/0, ticks=0/73116583, in_queue=73116972, util=100.00%